---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeTable.GetEnumerator
source: html/43851cab-1f6a-7a39-9894-13bc9afb38f3.htm
---
# Autodesk.Revit.DB.ExportLinetypeTable.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo>> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.